toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        for (;;) {
            _Scheduler::Sleep(_Scheduler::Ms(1000));
            
            _ICEInit();
        }
    }
    
    static bool DeepSleepOK() {
        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
        // care of.)
        return _WaitingForMotion                &&
               !_Scheduler::Running<_TaskSD>()  &&
               !_Scheduler::Running<_TaskImg>() ;
    }
    
    static void HostModeSet(bool en) {
        // Short-circuit if the state hasn't changed
        if (_HostMode == en) return;
        _HostMode = en;
        
        if (_HostMode) {
            // Reset state
            _WaitingForMotion = false;
            _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
            _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
            // Stop _TaskMain
            _Scheduler::Stop<_TaskMain>();
            // Turn off power
            _VDDIMGSDSet(false);
            _VDDBSet(false);
        
        } else {
            _Scheduler::Start<_TaskMain>(Run);
        }
    }
    
    static void ISR_MotionSignal(uint16_t iv) {
        _Motion = true;
    }
    
    static inline bool _HostMode = false;
    
    // _Init: stores whether this is the first
    [[gnu::section(".ram_backup.main")]]
    static inline bool _Init = false;
    
    // _Motion: announces that motion occurred
    // _Motion: atomic because it's modified from the interrupt context
    static inline std::atomic<bool> _Motion = false;
    static inline bool _WaitingForMotion = false;
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
            // Relinquish LEDs
            _LEDRed_::Set(_LEDRed_::Priority::High, std::nullopt);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, std::nullopt);
            
            // Exit host mode
            _TaskMain::HostModeSet(false);
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDRed_::Priority::High, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            _TaskMain::HostModeSet(cmd.arg.HostModeSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static inline bool _HostMode = false;
    
    // Task stack
    [[gnu::section(".stack._TaskI2C")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

struct _TaskButton {
    static void Run() {
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            switch (ev) {
            case _Button::Event::Press:
                // Take a photo
                _LEDRed_::Set(_LEDRed_::Priority::Low, 0);
                _Scheduler::Sleep(_Scheduler::Ms(250));
                _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
                break;
            
            case _Button::Event::Hold:
                // Turn off
                _LEDGreen_::Set(_LEDGreen_::Priority::Low, 0);
                _Scheduler::Sleep(_Scheduler::Ms(250));
                _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
                break;
            }
        }
    }
    
    // Task stack
    [[gnu::section(".stack._TaskButton")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[128];
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

